app/views/rooms/new.html.erb

            <option value="">チャットするユーザーを選択してください</option>
            <% User.where.not(id: current_user.id).each do |user| %>
---
SELECT `users`.* FROM `users`