app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('新規ルーム１', '2021-03-01 07:53:28.013198', '2021-03-01 07:53:28.013198')

  def destroy
    room = Room.find(params[:id])
    room.destroy
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 8 LIMIT 1
DELETE FROM `rooms` WHERE `rooms`.`id` = 8